National_bank_xml/MT910encrypted_signed.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns3:getMt910RequestMt102 xmlns:ns2="http://strukturaRtgsNaloga.xml.com" xmlns:ns3="http://mt102.xml.com"><xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Type="http://www.w3.org/2001/04/xmlenc#Content"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#tripledes-cbc"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:KeyName>Sifrovan tajni kljuc</ds:KeyName>
<xenc:EncryptedKey><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"/><xenc:CipherData><xenc:CipherValue>Cl3FW/2Ogb2ge7B8Du/PhSlFCz5e7qcM4SEYe1iBy6UtgdMfah6Hc2Eh0Mjf+xqO+20u9xW6fzgM&#13;
TOwWAnCEVn/Qy5FrgsdqdpMP88HEUAvwd93LbfbEK0KC75zmcXB+V+qzEUpb9HcAc1FTpnkO8A+j&#13;
5QL1QWNyF7VgjOj/o2+qTkbYKAA4xJiqRVHFuxWhX6dHtIROLSTMleTlI6kB4tiOob2XE3kzlyau&#13;
QxnFN8TJ0JqTiAkQ7IhvMoKex0Sq6NLORrLfYdoJHyZrJSVmHp7ny69s3PFNTTtQWe2ncEa9nYZA&#13;
dVAA5UF3t6H3UvhBPCWVtK2Uwh5nfgSYOOY21A==</xenc:CipherValue></xenc:CipherData></xenc:EncryptedKey></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>8lcIxfsf18eoZBvUzNMidVszPIgVSKXROdXcCHrW55w7ki1AkktCZkkUkCBWmek/GojddGvYEEZE&#13;
u/7YFTCGEUZzBQE3XxEXZoLEvFPSkOCU2bMIXO5z4gqbgCIJezXX5ctNkz/WnRrPPL7d8Y11fvN6&#13;
38YimrJJZYGwnD7G8K7UppxnTmq3hclnak8uimg6x8WRPbYcTTT393WUcwovrXqZQ7yGJBpukGbj&#13;
nB/6gLwNalGOSlXxaooAG8YmZXT3KOjw10gWR4co/khK7bVrQULX364Hv6rxX2dHSTYhY6xMcpdO&#13;
SsbFWzsLRKI+deYw2I2X6UNus0KyEG/5Ep7ISc4l28CppzQ358Cfk5NF2bsIomCvAix9NCxYP5wa&#13;
OHJPYiuQrowKneEkfAT5KF4R3IEK380EiPqKMWc9LAvPGt9acyn/bhhgNUHfFu8I15Dp8arksrp7&#13;
RaQXIv9lNmN93i4P1IZllirQS3gsTfy1i5rMaG/BHo01PjrIzPkwjsVE/ntmEcej8mECD+oO3MAy&#13;
BNWj1HO59ouKgHoLOrXZll025nIK60qZzE83dJfj7+wbhLdZ4ecL3nXvRBpzQV0Mb1uVwiRjQHKn&#13;
qSFj2Ar/p5QFyVfcrXfdHNxOaCky/3Y2ueIzO1lyFGFX6n0IcmtFEKo3IBeIi5S6TeyRYWuhrVBW&#13;
ha7RxEPIXhih+raz4eLZpxWbdIijoR5p6MiwHv6PQNwoZndNr9S7KI59ncuxBl+fiVP2J22tdcZK&#13;
8FWSffk4Iyu/IDB3lXhfMvHEDhulp3Z5eBJ+AAI576g+jEls6YKNoxVQRgQyM2e+DR6X6uHXT2Nc&#13;
bGYCyvjdoP//L3yfDC2HXrc/s5QMblOpFN/aWKEP1lkDSyR8DB8+La4svLzRFVFKVeROx3t8rWKy&#13;
2PgP5AOqvr5ZRA+f68Q+gjCQZ4hcOmISb/l8epbi8qbpIYqaLS86AqcqyyRp7c3oYwzMu3cU7gRp&#13;
+CVKbiHnnCyM/69Uwy2Xa1pZLYYPukUmfCi67HcZ7BgxbjpGdLX5zhQyrerpx+FN9W04v3rHFSGN&#13;
DcGchy4SHKw2a1MRLNeSOL8kivT/k2ik1syIEe3Czrp956tHOX/dG133hB/48+N1+PqAnp71jxiP&#13;
3dXGanePHVr3zMW8R9PxVFYbVcvLDkSfF+QE4A0MAKCDLWKoMghyNgUFaR45W+bCLqsllgTf4cot&#13;
VDDQsyfOmj+2fa+P7x7fmHjGaQZKTmBWnCL0aJwVQ3IVKY2jlosvpigEbsrGS3+982ksTlkQCXnU&#13;
bwINalGIedB+jdyPRaPEJlvu+CTxtJCTJrnE1pfQ6r/23JRqNPNCcFuDueA7FUe8V5qV5Gz3wHtY&#13;
XOMwg3WxbqWi0eqLQ0I1AHCEJbPxI/oaIZcVsCGLe5AEXORcNb/KZy2W2rtRUNi0b21v7kDb5v2C&#13;
ANt5mma0p2EFEfTjz81J7Gewd0DEeMBlf/4t/rICOuP/N7dn2jNy+TKLKoOFBu7PbyXXuad1yp6B&#13;
ZMcMZvTGK6eBRmDwt7xAEKpFHX3StbRDijC+Jk4uc7r7Y22lBEtAdBdr+uWncOpz9FpupQ84p+jZ&#13;
vsmsN9PSYNYx7YR6EWzXQ1XzvRT0v87ZlS8KE2/y/aUfNeRwvW5QU6QVb6t3cGYWLzghdPp7Y1ye&#13;
0X6STuVup7I2kTBn5SNILjXWT1cEmSsifg4OtGNKEQY5a26/Bj7EXeh8iqm8ObORFllaHo3K0OSB&#13;
HhDpJ1CGBuDYk/R2VjY24eh171VGbMw5yUjZssD0lG8zNtSrd/l0BtV0gjvW3Wuj+ByA7azbqjgJ&#13;
uLwem7pTEmya5WPapUZe7IrfLJoEgYFQN7IO081I5EV6HtmfL0E/tv06ouqpvJhCe1qSAAGvJQBz&#13;
jdwRQ0I/t9/YLhUf0D08a1d4QeOl0DAgZhpEJjDmeES7vRKaDRZqiRTF1KybvNpj3tFGHahqdDRX&#13;
Xt9Kzh/DJBYnrfFsk//qlEwqHHyKV5lVylYcJ/dNFkfUZNwkR/ofsPHwqdSneyvgbI3pYe3nDtru&#13;
d1Esgc5D+fEhfwczWY9+1w45Mz7m3DD641M0s/A=</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData></ns3:getMt910RequestMt102></SOAP-ENV:Body><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:SignedInfo>
<ds:CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/>
<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
<ds:Reference URI="">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
<ds:Transform Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315#WithComments"/>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<ds:DigestValue>9/8N+pCAltgA+hc2Mar9VUmlSQo=</ds:DigestValue>
</ds:Reference>
</ds:SignedInfo>
<ds:SignatureValue>
cFPzEfuPeg5Mfxo6fBQ8on45SU6brW98ljh9C3sCLSA1GAqNct9IixIK2lzSm0yH1a/RB/8ktDmE&#13;
qlhgzD0SHUAgDn22pm9o6ktNaGiDLEW0PU/Q3YM4PE3RjGQy2dJMa+xz9m4Z1svVdhNAyukDhFmp&#13;
6Enc8LCfXrQjwNKDkJKhqh+nAVb0lEtULp9UK+FP38XvriRA/MxbAcaU0+tlQWAfqny77lQmt6O3&#13;
tY70Aa6rgkq96SE/UmpDzLkuPSXl/fq3ooHAp/1AOB9wuasrtDsmV3hstGKY7SsI4fQ1AtJMiFEq&#13;
csFeaxfQeATBrZQIlqixYyVmx/PblvSvovWHGA==
</ds:SignatureValue>
<ds:KeyInfo>
<ds:KeyValue>
<ds:RSAKeyValue>
<ds:Modulus>
iB4brM9IcSzO94vsP2oklqN2bnPRIj4WnkokiLR4pwUiZPDwNOmz8VXfq73I6HA1++WGYMTxBwwi&#13;
YTWlCvBBGoN/iKQNY31bk/8ybvHCH+jfLuMe6LGkOzqiXKOARR+13D4/55JmhGIry6ZaUHNnBEQw&#13;
oO9I30t90tLf+t2+AJUes1cRv8bbXtkoiykA4ZGdT+xaB8t41LIdNIRFNYaupGQPs3td7xZn7kJd&#13;
nEv2KIma8gOlDDkr8M2TARRmbcLSsr4MPXosIalThZE8Nt5l/zRQiRM9pSW2zAVAqQ/frLf8ZZuS&#13;
TQwy1wt+OJ4DX+DVcya9ONNRNXvfCMGyxdheyw==
</ds:Modulus>
<ds:Exponent>AQAB</ds:Exponent>
</ds:RSAKeyValue>
</ds:KeyValue>
<ds:X509Data>
<ds:X509Certificate>
MIIDyDCCArCgAwIBAgIEWUhQjjANBgkqhkiG9w0BAQsFADCBlDEWMBQGA1UEAwwNTmFyb2RuYSBi&#13;
YW5rYTEWMBQGA1UECgwNTmFyb2RuYSBiYW5rYTEWMBQGA1UECwwNTmFyb2RuYSBiYW5rYTEMMAoG&#13;
A1UEBhMDc3JiMSAwHgYJKoZIhvcNAQkBFhFuYXJvZG5hQGJhbmthLmNvbTEaMBgGCgmSJomT8ixk&#13;
AQEMCjE0OTc5MTE0MzgwHhcNMTcwNjE5MDAwMDAwWhcNMTgwNjE5MDAwMDAwWjCBlDEWMBQGA1UE&#13;
AwwNTmFyb2RuYSBiYW5rYTEWMBQGA1UECgwNTmFyb2RuYSBiYW5rYTEWMBQGA1UECwwNTmFyb2Ru&#13;
YSBiYW5rYTEMMAoGA1UEBhMDc3JiMSAwHgYJKoZIhvcNAQkBFhFuYXJvZG5hQGJhbmthLmNvbTEa&#13;
MBgGCgmSJomT8ixkAQEMCjE0OTc5MTE0MzgwggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEKAoIB&#13;
AQCIHhusz0hxLM73i+w/aiSWo3Zuc9EiPhaeSiSItHinBSJk8PA06bPxVd+rvcjocDX75YZgxPEH&#13;
DCJhNaUK8EEag3+IpA1jfVuT/zJu8cIf6N8u4x7osaQ7OqJco4BFH7XcPj/nkmaEYivLplpQc2cE&#13;
RDCg70jfS33S0t/63b4AlR6zVxG/xtte2SiLKQDhkZ1P7FoHy3jUsh00hEU1hq6kZA+ze13vFmfu&#13;
Ql2cS/YoiZryA6UMOSvwzZMBFGZtwtKyvgw9eiwhqVOFkTw23mX/NFCJEz2lJbbMBUCpD9+st/xl&#13;
m5JNDDLXC344ngNf4NVzJr0401E1e98IwbLF2F7LAgMBAAGjIDAeMA8GA1UdEwEB/wQFMAMBAf8w&#13;
CwYDVR0PBAQDAgH2MA0GCSqGSIb3DQEBCwUAA4IBAQBKgkCxBNwHmG/wEYU8Od6HkxihXWPj1h12&#13;
fG+q61jmb4fYSRfJ0izYvn5nrXht+WQh/TSDoR5b/FyKbjwyTqT14F+SduxLVKQ2SEdeO/nvHE3r&#13;
nQBV4fRejhZU5tfX6L5axwh33CP+S1BJ/hVzF5q2gctUkL4lCcfvcjk+ybKoi0+d4xuavtHrdfc8&#13;
B3R5xQoJHpWijNLg0JQn76/9gt1GMvBduxBUB1RE32w0+mWlCI1aQEOcM69rXRgRW6BWWP1GyMGr&#13;
YeOsFn5vAOQWf2es2a7JbPdCz78z61ULiljUXSYC60ihwwBCoC0ehlp1itw6xPMtT2xlzvAZ2a+l&#13;
miTA
</ds:X509Certificate>
</ds:X509Data>
</ds:KeyInfo>
</ds:Signature></SOAP-ENV:Envelope>